app/Actions/User/CartQuantity.php

    public function execute():int
    {
        $cart=$this->getCartFromCookie->execute();

        if (isset($cart)){
            return $cart->products->pluck('pivot.quantity')->sum();
---
select `products`.*, `cart_product`.`cart_id` as `pivot_cart_id`, `cart_product`.`product_id` as `pivot_product_id`, `cart_product`.`quantity` as `pivot_quantity` from `products` inner join `cart_product` on `products`.`id` = `cart_product`.`product_id` where `cart_product`.`cart_id` = 1 and `products`.`deleted_at` is null