app/Actions/User/getCartFromCookie.php

    public function execute()
    {
        $cartId=Cookie::get('cart');
        $cart=Cart::find($cartId);
---
select * from `carts` where `carts`.`id` is null limit 1