app/Actions/User/GetCartFromCookieOrCreateAction.php

    public function execute(): Cart
    {
        $cart = $this->getCartFromCookie->execute();
        return $cart ?? Cart::create();
---
insert into `carts` (`updated_at`, `created_at`) values ('2022-03-31 11:05:27', '2022-03-31 11:05:27')