app/Actions/Admin/UpdateProductImagesAction.php

update `images` set `deleted_at` = '2022-03-31 11:06:05', `images`.`updated_at` = '2022-03-31 11:06:05' where `id` = 1
insert into `images` (`file_name`, `product_id`, `updated_at`, `created_at`) values ('f04dded7-91ab-417f-8a98-36d1317bfac7.jpg', 4, '2022-03-31 11:06:05', '2022-03-31 11:06:05')
---
    public function execute(array $files, Product $product): void
    {
        $productImages = collect();

        foreach ($product->images as $image) {
            Storage::disk(config('filesystems.images_disk'))->delete($product->id . '/' . $image->file_name);
            $image->delete();
        }

        foreach ($files as $file) {
            $image = new Image();
            $image->file_name = (string)Str::uuid() . '.' . $file->clientExtension();

            $file->storeAs($product->id, $image->file_name, config('filesystems.images_disk'));
            //path , name , disk
            $productImages->push($image);
        }
//
        $product->images()->saveMany($productImages);