app/Http/Controllers/OrderController.php

    public  function index(Request $request){

        $user=$request->user();

        return view('ordersIndex')->with('orders',$user->orders()->orderBy('id', 'DESC')->paginate(6));
---
select * from `orders` where `orders`.`user_id` = 2 and `orders`.`user_id` is not null order by `id` desc limit 6 offset 0
select count(*) as aggregate from `orders` where `orders`.`user_id` = 2 and `orders`.`user_id` is not null

    public function store(Request $request)
    {
//        dump($request->all());
        return DB::transaction(function () use($request){
            $user=$request->user();
            $order=$user->orders()->create([
                'state'=>'PENDING'
            ]);
            $cart=$this->getCartFromCookie->execute();

            $error=false;
            $messages=[];
            if ($cart->products->isEmpty()){
                throw ValidationException::withMessages([
                    'product'=>"Se ha enviado un carrito de compras vacio intente nuevamente añadir y realizar la compra",
                ]);
            }
            //toma cada elemento de la collecion pasa por la funcion anomima como parametro $product
            //genera un array $element donde  definimos la key o llave para acceder y los valores que contiene
            //esa llave del array en este caso para poder usar attach necesitamos como llave los id de los
            //productos y el valor  de quantity en ese registro

            $cartProductWithQuantity=$cart->products
                ->mapWithKeys(function ($product){
---
select `products`.*, `cart_product`.`cart_id` as `pivot_cart_id`, `cart_product`.`product_id` as `pivot_product_id`, `cart_product`.`quantity` as `pivot_quantity` from `products` inner join `cart_product` on `products`.`id` = `cart_product`.`product_id` where `cart_product`.`cart_id` = 1 and `products`.`deleted_at` is null

                            'product'=>"Se ha alcanzado el stock maximo del producto  {$product->name} , hay disponibles  {$product->quantity} unidades",
                        ]);
                    }
                    $product->decrement('quantity',$quantity);
---
update `products` set `quantity` = `quantity` - 1, `products`.`updated_at` = '2022-03-31 11:17:14' where `id` = 2 and `products`.`deleted_at` is null

                    return $element;
                });

            $order->products()->attach($cartProductWithQuantity->toArray());
            $order->total=$order->products->pluck('total')->sum();
            $order->currency='COP';
            $order->save();
            $cart->products()->detach();
---
insert into `order_product` (`order_id`, `product_id`, `quantity`) values (4, 2, 1)
select `products`.*, `order_product`.`order_id` as `pivot_order_id`, `order_product`.`product_id` as `pivot_product_id`, `order_product`.`quantity` as `pivot_quantity` from `products` inner join `order_product` on `products`.`id` = `order_product`.`product_id` where `order_product`.`order_id` = 4 and `products`.`deleted_at` is null
update `orders` set `total` = 754325, `currency` = 'COP', `orders`.`updated_at` = '2022-03-31 11:17:14' where `id` = 4
delete from `cart_product` where `cart_product`.`cart_id` = 1


                $order->session_id= $session['requestId'];
                $order->process_url=$session['processUrl'];
                $order->save();
---
update `orders` set `session_id` = 51978, `process_url` = 'https://checkout-co.placetopay.dev/session/51978/7415823a8f51df29f2949a81bbccd550', `orders`.`updated_at` = '2022-03-31 11:17:15' where `id` = 4

    public function returnPay(Order $order)
    {
        if (isset($order))
        {
            $response=$this->webcheckoutService->getInformation($order->session_id);
            if (!($order->state == $response['status']['status'])){
                $order->state=$response['status']['status'];
                if ($response['status']['status']=="REJECTED")
                {
                    dump('Retornando a Buyme,  PAGO RECHAZADO');
                    foreach ($order->products as $product)
                    {
                        dump('product antes de retornar el stock',$product->quantity);

                        $product->increment('quantity',$product->pivot->quantity);
                        dump('product despues de retornar el stock',$product->quantity);
                    }
                }
                $order->save();
---
update `products` set `quantity` = `quantity` + 1, `products`.`updated_at` = '2022-03-31 11:17:55' where `id` = 2 and `products`.`deleted_at` is null
update `orders` set `state` = 'REJECTED', `orders`.`updated_at` = '2022-03-31 11:17:55' where `id` = 4