app/Http/Controllers/ProductController.php

    public function index()
    {

//        $products=Product::select('id','name','description','maker','quantity','state')->paginate(6);
        $products = Product::select('id', 'name', 'description', 'maker', 'quantity', 'state')->get();
        return view('admin.products')->with('products', $products);
---
select `id`, `name`, `description`, `maker`, `quantity`, `state` from `products` where `products`.`deleted_at` is null

    public function State(Request $request, int $id)
    {
        $product = Product::find($id);

        $product->state = $product->state == 'active' ? 'inactive' : 'active';

        $product->save();
---
select * from `products` where `products`.`id` = 4 and `products`.`deleted_at` is null limit 1
update `products` set `state` = 'active', `products`.`updated_at` = '2022-03-31 11:05:05' where `id` = 4

    public function allToStore()
    {
//        $products=Product::select('id','name','description','maker','quantity','state')->get();

        $products = Product::select('id', 'price', 'name', 'description', 'maker', 'quantity', 'state', 'discount')
            ->active()->Stock()->paginate(6);
//        dump($products);
        return view('welcome')->with('products', $products);
---
select count(*) as aggregate from `products` where `state` != 'inactive' and `quantity` > '0' and `products`.`deleted_at` is null
select `id`, `price`, `name`, `description`, `maker`, `quantity`, `state`, `discount` from `products` where `state` != 'inactive' and `quantity` > '0' and `products`.`deleted_at` is null limit 6 offset 0

    public function search(Request $request)
    {
        $validator = Validator::make($request->all(), [
            'search'=>'required|max:160',
        ]);
        if ($validator->fails()) {
            $result = '';
            return view('welcome')->with('products', []);
            return redirect()->withErrors($validator);
        }
        $search = $request['search'];
        $products = Product::select('id', 'price', 'name', 'description', 'maker', 'quantity', 'state', 'discount')
            ->where([['state', '!=', 'inactive'], ['name', 'LIKE', '%' . $search . '%']])
            ->paginate(6);
//        dump($products);
        if (count($products) < 1) {
            $result = 'Sin resultados';
        } else {
            $result = '';
        }
//        dump($products);
//        return redirect()->back()->with('products',$products);
//        return vii  ->with('products',$products);
        return view('welcome')->with(['products'=>$products, 'result'=>$result]);
---
select count(*) as aggregate from `products` where (`state` != 'inactive' and `name` LIKE '%uteee%') and `products`.`deleted_at` is null
select `id`, `price`, `name`, `description`, `maker`, `quantity`, `state`, `discount` from `products` where (`state` != 'inactive' and `name` LIKE '%uteee%') and `products`.`deleted_at` is null limit 6 offset 0