app/Http/Controllers/ProductCartController.php

select * from `cart_product` where `cart_product`.`cart_id` = 1
select `products`.*, `cart_product`.`cart_id` as `pivot_cart_id`, `cart_product`.`product_id` as `pivot_product_id`, `cart_product`.`quantity` as `pivot_quantity` from `products` inner join `cart_product` on `products`.`id` = `cart_product`.`product_id` where `cart_product`.`cart_id` = 1 and `products`.`id` = 4 and `products`.`deleted_at` is null limit 1
insert into `cart_product` (`cart_id`, `product_id`, `quantity`) values (1, 4, 1)
---
    public function store(Request $request,
                          Product $product,
                          GetCartFromCookieOrCreateAction  $cartFromCookieOrCreateAction,
                          CreateCartCookie $createCartCookie
                        )
    {

        $cart= $cartFromCookieOrCreateAction->execute();

        $quantity=$cart->products()->find($product->id)->pivot->quantity ?? 0;


        if ($product->quantity < $quantity+1)
        {
            throw ValidationException::withMessages([
               'product'=>"Se ha alcanzado el stock maximo del producto  {$product->name} no puede agregar mas de {$product->quantity}",
            ]);
        }

        $cart->products()->syncWithoutDetaching([
            $product->id => ['quantity'=>$quantity + 1 ]
        ]);