app/Models/Order.php

select `products`.*, `order_product`.`order_id` as `pivot_order_id`, `order_product`.`product_id` as `pivot_product_id`, `order_product`.`quantity` as `pivot_quantity` from `products` inner join `order_product` on `products`.`id` = `order_product`.`product_id` where `order_product`.`order_id` = 6 and `products`.`deleted_at` is null
---
    public function getCountAttribute()
    {
        return $this->products->pluck('pivot.quantity')->sum();